def обчислити_знижку(початкова_ціна):
    if початкова_ціна > 100:
        знижка = 0.07  # 7% знижка
    elif початкова_ціна > 50:
        знижка = 0.05  # 5% знижка
    else:
        знижка = 0  # Без знижки

    знижена_ціна = початкова_ціна - (початкова_ціна * знижка)
    return знижена_ціна

початкова_ціна = float(input("Введіть вартість покупки: "))

if початкова_ціна < 0:
    print("Вартість покупки не може бути від'ємною.")
else:
    кінцева_ціна = обчислити_знижку(початкова_ціна)
    print("Загальна вартість покупки зі знижкою:", round(кінцева_ціна, 2), "грн.")
